In [6]:
import pandas as pd
import numpy as np

In [7]:
data = pd.read_csv('../data/clean/immigration_OECD.csv')
data

,Country of birth/nationality,VAR,Variable,Country,Year,Value
0,Afghanistan,B11,Inflows of foreign population by nationality,Australia,2000,887.0
1,Afghanistan,B11,Inflows of foreign population by nationality,Australia,2001,456.0
2,Afghanistan,B11,Inflows of foreign population by nationality,Australia,2002,660.0
3,Afghanistan,B11,Inflows of foreign population by nationality,Australia,2003,1015.0
4,Afghanistan,B11,Inflows of foreign population by nationality,Australia,2004,1340.0
...,...,...,...,...,...,...
439513,Stateless,B15,Stock of foreign population by nationality,Türkiye,2016,82.0
439514,Stateless,B15,Stock of foreign population by nationality,Türkiye,2017,132.0
439515,Stateless,B15,Stock of foreign population by nationality,Türkiye,2018,170.0
439516,Stateless,B15,Stock of foreign population by nationality,Türkiye,2019,320.0
439517,Stateless,B15,Stock of foreign population by nationality,Türkiye,2020,394.0

In [3]:
data.describe().T

,count,mean,std,min,25%,50%,75%,max
Year,439518.0,2011.320014,5.868698,2000.0,2007.0,2012.0,2016.0,2021.0
Value,439518.0,14771.224996,366743.032206,-18.0,1.0,31.0,489.0,45273000.0

In [8]:
data['Variable'].value_counts()

Variable
Inflows of foreign population by nationality                   106723
Acquisition of nationality by country of former nationality     97573
Stock of foreign population by nationality                      84693
Outflows of foreign population by nationality                   76475
Stock of foreign-born population by country of birth            74054
Name: count, dtype: int64

In [ ]:
.set_index('Variable')

In [9]:
immi = data.copy().set_index('Variable')
immi = immi.loc[['Inflows of foreign population by nationality']]
immi = immi[immi['Year'] == 2020]
immi

,Country of birth/nationality,VAR,Country,Year,Value
Variable,,,,,
Inflows of foreign population by nationality,Afghanistan,B11,Australia,2020,2229.0
Inflows of foreign population by nationality,Afghanistan,B11,Austria,2020,1492.0
Inflows of foreign population by nationality,Afghanistan,B11,Belgium,2020,3163.0
Inflows of foreign population by nationality,Afghanistan,B11,Canada,2020,1660.0
Inflows of foreign population by nationality,Afghanistan,B11,Czech Republic,2020,13.0
...,...,...,...,...,...
Inflows of foreign population by nationality,Nicaragua,B11,Latvia,2020,1.0
Inflows of foreign population by nationality,Guam,B11,Latvia,2020,0.0
Inflows of foreign population by nationality,Philippines,B11,Latvia,2020,3.0
Inflows of foreign population by nationality,Samoa,B11,Latvia,2020,0.0
Inflows of foreign population by nationality,Finland,B11,Latvia,2020,14.0

In [2]:
def top_5(immi):

    for year in immi['Year']:

        if year > 2009:

            max_immi1 = immi[[ 'Country', 'Year', 'Value']].pivot_table(index=[ 'Country', 'Year'],  values = ['Value'], aggfunc = ['sum'] )
            display(max_immi1)

            max_immi2 = max_immi1.sort_values(by = ('sum', 'Value'), ascending=False).iloc[0:5]
            max_immi2

        else: 
            pass

    return max_immi2

In [39]:
max_immi = immi.copy()

In [40]:
max_immi1 = max_immi[[ 'Country', 'Year', 'Value']].pivot_table(index=[ 'Country', 'Year'], aggfunc = ['sum'] )
display(max_immi1)

                            sum
                          Value
Country         Year
Australia       2020   274810.0
Austria         2020   241836.0
Belgium         2020   202405.0
Canada          2020   368880.0
Chile           2020   303836.0
Czech Republic  2020   107334.0
Denmark         2020    75464.0
Estonia         2020    15176.0
Finland         2020    46494.0
France          2020   406800.0
Germany         2020  1973054.0
Greece          2020    63357.0
Hungary         2020    87274.0
Iceland         2020    15415.0
Ireland         2020    62000.0
Israel          2020    50210.0
Italy           2020   381793.0
Japan           2020   441002.0
Korea           2020   466220.0
Latvia          2020     8765.0
Luxembourg      2020    41903.0
Mexico          2020   114844.0
Netherlands     2020   341116.0
New Zealand     2020   107424.0
Norway          2020    61330.0
Poland          2020   326308.0
Portugal        2020   226165.0
Slovak Republic 2020     5668.0
Slovenia        2020    46253.0
Spain           2020   805654.0
Sweden          2020   131431.0
Switzerland     2020   271878.0
United States   2020  1414349.0

In [97]:
max_immi1.columns

MultiIndex([('sum', 'Value')],
           )

In [89]:
max_country = max_immi1.idxmax() #getting index of top policy sold
max_country

sum  Value    (Germany, 2020)
dtype: object

In [138]:
max_immi2 = max_immi1.sort_values(by = ('sum', 'Value'), ascending=False).iloc[0:5]

max_immi2

                          sum
                        Value
Country       Year
Germany       2020  1973054.0
United States 2020  1414349.0
Spain         2020   805654.0
Korea         2020   466220.0
Japan         2020   441002.0

In [118]:
max_immi2 = max_immi1.sort_values(('sum', 'Value'), ascending=False).head(5)

max_immi2

                          sum
                        Value
Country       Year
Germany       2020  1973054.0
United States 2020  1414349.0
Spain         2020   805654.0
Korea         2020   466220.0
Japan         2020   441002.0

In [42]:
def top_5(data, year= int):

    

    immi = data.copy().set_index('Variable')
    immi = immi.loc[['Inflows of foreign population by nationality']]
    immi = immi[immi['Year'] == year]

       

    max_immi1 = immi[[ 'Country', 'Year', 'Value']].pivot_table(index=[ 'Country', 'Year'], aggfunc = ['sum'] )
            

    max_immi2 = max_immi1.sort_values(by = ('sum', 'Value'), ascending=False).iloc[0:5]
    max_immi2

    

    return max_immi2

In [43]:
top_5(data, 2010)

                           sum
                         Value
Country        Year
United States  2010  2087721.0
Germany        2010  1358364.0
Italy          2010   848950.0
United Kingdom 2010   821000.0
Spain          2010   660420.0

In [44]:
top_5(data, 2011)

                           sum
                         Value
Country        Year
United States  2011  2126346.0
Germany        2011  1674171.0
United Kingdom 2011   888000.0
Italy          2011   705799.0
Spain          2011   671519.0

In [45]:
top_5(data, 2012)

                           sum
                         Value
Country        Year
United States  2012  2065313.0
Germany        2012  1920476.0
United Kingdom 2012   742000.0
Italy          2012   640076.0
Japan          2012   607608.0

In [46]:
top_5(data, 2013)

                           sum
                         Value
Country        Year
Germany        2013  2201352.0
United States  2013  1983160.0
United Kingdom 2013   804000.0
Korea          2013   720937.0
Japan          2013   613203.0

In [47]:
top_5(data, 2014)

                           sum
                         Value
Country        Year
Germany        2014  2657504.0
United States  2014  2035094.0
United Kingdom 2014   983000.0
Korea          2014   814108.0
Japan          2014   672823.0

In [48]:
top_5(data, 2015)

                           sum
                         Value
Country        Year
Germany        2015  3975108.0
United States  2015  2103870.0
United Kingdom 2015   948000.0
Japan          2015   781986.0
Korea          2015   745858.0

In [49]:
top_5(data, 2016)

                           sum
                         Value
Country        Year
Germany        2016  3415809.0
United States  2016  2369212.0
Japan          2016   854778.0
United Kingdom 2016   823000.0
Korea          2016   804392.0

In [50]:
top_5(data, 2017)

                           sum
                         Value
Country        Year
Germany        2017  2745154.0
United States  2017  2256386.0
Japan          2017   949486.0
United Kingdom 2017   946000.0
Spain          2017   907385.0

In [51]:
top_5(data, 2018)

                          sum
                        Value
Country       Year
Germany       2018  2745106.0
United States 2018  2194811.0
Spain         2018  1119349.0
Japan         2018  1038903.0
Korea         2018   990137.0

In [52]:
top_5(data, 2019)

                          sum
                        Value
Country       Year
Germany       2019  2668348.0
United States 2019  2063219.0
Spain         2019  1328551.0
Japan         2019  1183371.0
Türkiye       2019  1153793.0

In [53]:
top_5(data, 2020)

                          sum
                        Value
Country       Year
Germany       2020  1973054.0
United States 2020  1414349.0
Spain         2020   805654.0
Korea         2020   466220.0
Japan         2020   441002.0